/*

//---------------------------------------------------------------------------------------------------------------
//
//
// [ 入門 ] 時間カウントサンプル
//
//
//---------------------------------------------------------------------------------------------------------------


#include <time.h>
#include <string>
#include "../dxlib_ext/dxlib_ext.h"
#include "gm_main.h"


// 毎フレーム経過時間を加算する変数
float progress_time = 0;


//------------------------------------------------------------------------------------------------------------
// ゲーム起動時に１度だけ実行されます
void gameStart() {
	srand(time(0));
	SetFontSize(30);
}


//------------------------------------------------------------------------------------------------------------
// 毎フレーム実行されます
//
// delta_time には前回フレームからの経過秒数が入ります
//
void gameMain(float delta_time) {

	// 前回フレームからの経過秒数を加算することでトータルの経過時間とする
	progress_time += delta_time;

	DrawStringEx(0, 0, -1, "経過時間 %.2f 秒", progress_time);


	DrawFpsIndicator({ 10, DXE_WINDOW_HEIGHT - 10, 0 }, delta_time);
}


//------------------------------------------------------------------------------------------------------------
// ゲーム終了時に１度だけ実行されます
void gameEnd() {
}


*/